index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-14 Sat 01:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manuel Graf" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#353dafb0-9e65-48b8-bca0-434f1b356890">1. Teaching Turning about Languages, Operating Systems and Networks</a>
<ul>
<li><a href="#org25a8827">1.1. Operating Systems</a></li>
<li><a href="#orgb155a70">1.2. Languages</a></li>
<li><a href="#orgf0a08d8">1.3. Networks</a></li>
</ul>
</li>
<li><a href="#orgfab5c89">2. Ken Quotes</a>
<ul>
<li><a href="#org85212dc">2.1. Counteracting the rosy future</a></li>
<li><a href="#org39381f1">2.2. The Maury Povich Show</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The Next Lines Are a partial transcipt of <a href="https://youtu.be/dsMKJKTOte0?t=597">Systems Architecture, Design,
Engineering, and Verification</a>, during which Ken Thompson was asked to answer a
question resembling something like
</p>
<pre class="example">
Would the universal Turing machine have had the same impact, if it had 20000
instructions instead of the very few elegant, that it did.
</pre>
<p>
.
</p>

<p>
The following is, what Mr. Kenneth Lane Thompson made out of it, rearranged with
an artistic license by myself, to - hopefully - make the written form equally
enjoyable to read as watching the hilarious talk itself.
</p>

<div id="outline-container-org823f603" class="outline-2">
<h2 id="353dafb0-9e65-48b8-bca0-434f1b356890"><a id="org823f603"></a><span class="section-number-2">1</span> Teaching Turning about Languages, Operating Systems and Networks</h2>
<div class="outline-text-2" id="text-353dafb0-9e65-48b8-bca0-434f1b356890">
<p>
&#x2026;because these are Probably the three biggest advances in computers.
</p>

<p>
I wonder what would happen if you could grab Turing in 1954, just before he died
of course and drag him up here, skipping everything between and then try to
teach him what's going on in his absence.
You'd have to tell him about operating systems because he's never heard the
word.
You'd have to tell him about compilers, he's never heard the word.
</p>

<p>
I don't know if you guys know that, but as a sidenote, the other thing he was
big in, was games.
He actually wrote the first computer algorithm for playing chess and played the
first computer chess game.
The computer was simulated by him, by hand, it wasn't a real computer but it was
a real algorithm.
So I guess you don't have to tell him about games.
</p>
</div>

<div id="outline-container-org25a8827" class="outline-3">
<h3 id="org25a8827"><span class="section-number-3">1.1</span> Operating Systems</h3>
<div class="outline-text-3" id="text-1-1">
<p>
But if you want to tell him about operating systems, what you do is, you open a
box from Dell, I guess, or some place like that, hand him a computer and a stack
of install discs and tell him, "It's your turn, go ahead!".
And it would be probably a week of Turing time - you understand that's different
than normal time - and half of that time he'd be on the phone with you, waiting
for a computer answer kind of thing.
So then he'd get his computer up &#x2026; maybe &#x2026; but probably with help. He'd put
it there and he'd sit and think for a while, before he got his first three
emails about a prince in Nairobi or someplace like that or an advertisement for
Viagra. After which his computer would be part of a botnet sending these things
out because of course he didn't have a firewall on it, because no one told him.
</p>
</div>
</div>

<div id="outline-container-orgb155a70" class="outline-3">
<h3 id="orgb155a70"><span class="section-number-3">1.2</span> Languages</h3>
<div class="outline-text-3" id="text-1-2">
<p>
So the next thing you teach Turning would be languages and you know, it would be
a concept. He grasped the concept but then you'd hand him a C++ manual and I
think - we previously talked about just a couple of weeks of Turing time -, that
would be a lifetime gone.
</p>
</div>
</div>

<div id="outline-container-orgf0a08d8" class="outline-3">
<h3 id="orgf0a08d8"><span class="section-number-3">1.3</span> Networks</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Then you teach him networks.
Networks are still good.
Unfortunately they open you up to a horrible world out there.
But there are some really really bright spots like Wikipedia and things like
that.
So I'm still optimistic about networks.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfab5c89" class="outline-2">
<h2 id="orgfab5c89"><span class="section-number-2">2</span> Ken Quotes</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x2026;that are still outstanding but I couldn't fit well in the flow of
<a href="#353dafb0-9e65-48b8-bca0-434f1b356890">1</a>.
</p>
</div>

<div id="outline-container-org85212dc" class="outline-3">
<h3 id="org85212dc"><span class="section-number-3">2.1</span> Counteracting the rosy future</h3>
<div class="outline-text-3" id="text-2-1">
<blockquote>
<p>
It's not all rosy.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org39381f1" class="outline-3">
<h3 id="org39381f1"><span class="section-number-3">2.2</span> <a href="https://en.wikipedia.org/wiki/Maury_(talk_show)">The Maury Povich Show</a></h3>
<div class="outline-text-3" id="text-2-2">
<blockquote>
<p>
I feel now kind of probably the way, one of the pioneers of television would
feel, if he came and saw Maury Povich or something like that.
</p>
</blockquote>
</div>
</div>
</div>
</div>
</body>
</html>
